# Pandas stands for Panel data library. It is the most popular data analysis library for Python and comes with many tools

#### Pandas series is an array of information organized by an index which is named index

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']

In [3]:
mylist = [10,20,30]

In [4]:
arr = np.array(mylist)

In [5]:
d = {'a':10,'b':20,'c':30} # lets create a dictionary

In [6]:
pd.Series(data=mylist)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(data=arr,index=labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(data=[10,'a',4.4]) # series can hold data of various types

0     10
1      a
2    4.4
dtype: object

In [10]:
ser1 = pd.Series([1,2,3,4],index=['USA','GERMANY','USSR','JAPAN'])
ser1

USA        1
GERMANY    2
USSR       3
JAPAN      4
dtype: int64

In [11]:
ser1['USA']

1

In [12]:
ser2 = pd.Series([1,4,5,6],index=['USA','GERMANY','ITALY','JAPAN'])
ser2

USA        1
GERMANY    4
ITALY      5
JAPAN      6
dtype: int64

In [13]:
# Pandas can have operations on series - which is performed based on index
ser1 + ser2

GERMANY     6.0
ITALY       NaN
JAPAN      10.0
USA         2.0
USSR        NaN
dtype: float64

#### Pandas DataFrames

#### A Pandas dataframes is implemented as multiple series that share the same index.
#### It is essentially a tabular data storage format

In [15]:
from numpy.random import randn
np.random.seed(101)
rand_mat = randn(5,4)
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [59]:
df = pd.DataFrame(data=rand_mat,index='A B C D E'.split(),
                  columns = 'W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [20]:
type(df['W'])

pandas.core.series.Series

In [21]:
mylist = ['W','Y']
df[mylist]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [22]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [23]:
df['NEW'] = df['W'] + df['Y'] # create a new column out of an operation
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [25]:
df.drop('NEW',axis=1,inplace=True) # drop a column

In [26]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df.drop('A')

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
# Two ways for selecting rows
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [29]:
df.iloc[0] # Index location - index of the first row

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [30]:
# Selecting multiple rows
df.loc[['A','E']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df.iloc[[0,3]]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
D  0.188695 -0.758872 -0.933237  0.955057

In [32]:
# selecting a subset / slice

In [33]:
df.loc[['A','B']][['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [34]:
df.loc[['A','B'],['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965

In [35]:
# Conditional selection from dataframes

In [41]:
df[df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
df[df['W'] > 0] # returns the data frame with rows where W > 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
# Further subset only Z column
df[df['W'] > 0]['Z']

A    0.503826
B    0.605965
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [44]:
# Further subset only Z column and E row
df[df['W'] > 0]['Z'].loc['E']

0.6835088855389145

In [46]:
df [(df['W'] > 0) & (df['Y'] > 1)] # combining multiple conditions

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [48]:
df.reset_index() # This converts the index to a column and adds a default index

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [60]:
new_ind = 'CA NY WY OR CO'.split()

In [61]:
df['States'] = new_ind

In [62]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [52]:
# If we have to use the States column as index

In [63]:
df.set_index('States',inplace=True)

In [58]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
W    5 non-null float64
X    5 non-null float64
Y    5 non-null float64
Z    5 non-null float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [64]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [65]:
df.dtypes

W    float64
X    float64
Y    float64
Z    float64
dtype: object

In [66]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

In [68]:
(df['W'] > 0).value_counts()

True     4
False    1
Name: W, dtype: int64

In [69]:
# if we do sum, it will only return the number of True
sum(df['W'] > 0)

4

In [70]:
len(df['W'] > 0)

5

#### We will now handle missing data with Pandas

In [4]:
# Lets create a dataframe and pass a dictionary
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
# in order to drop all missing data - by default this happens row wise
df.dropna()

     A    B  C
0  1.0  5.0  1

In [6]:
# in order to drop missing data column wise
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [7]:
# in order to drop missing values with threshold - For example, we will drop only when the number of
# missing values is more than 1 
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [9]:
# fill in missing data
df.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [13]:
# A smarter way to do this
df.fillna(value=df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [14]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

#### Group By Operations

#### Group By operations involve
- Split
- Apply
- Combine

In [2]:
# create a dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'], 'Person':['Sam','Charlie','Amy',
                                                                    'Vanessa','Carl',
                                                                    'Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [3]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [6]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [7]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [8]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

#### Common Operations

In [9]:
# Lets create a dataframe
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [10]:
# unique values in a column
df['col2'].unique()

array([444, 555, 666])

In [11]:
# number of unique values
df['col2'].nunique()

3

In [12]:
# number of instances per unique values
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [13]:
# values where col1 > 2
# col2 == 444
newdf = df [(df['col1'] > 2) & (df['col2'] == 444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [14]:
# create a simple function
def times_two(number):
    return number * 2

In [15]:
times_two(4)

8

In [16]:
# we can apply this function to a column
df ['col1'].apply(times_two)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [18]:
df['new'] = df['col1'].apply(times_two)
df

   col1  col2 col3  new
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

In [19]:
# permanently remove a column
del df['new']
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [20]:
# to see all the columns
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [21]:
# to get the indexes
df.index

RangeIndex(start=0, stop=4, step=1)

In [22]:
# quick info about dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
col1    4 non-null int64
col2    4 non-null int64
col3    4 non-null object
dtypes: int64(2), object(1)
memory usage: 176.0+ bytes

In [23]:
# summary statistics
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [24]:
# sort and order a dataframe - default is ascending 
df.sort_values(by = 'col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [27]:
df.sort_values(by = 'col2', ascending = False)
# Please note , indexes are going to remain the same

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

#### Data Input and Output with Pandas

In [28]:
pwd

'/Users/suvosmac/Documents/CodeMagic/MLPY-TimeSeriesAnalysis'

In [31]:
df = pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [32]:
newdf = df [['a','b']]
newdf

    a   b
0   0   1
1   4   5
2   8   9
3  12  13

In [33]:
newdf.to_csv('mynew.csv',index=False)

In [36]:
# read excel files
df = pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

In [37]:
df.columns

Index(['Unnamed: 0', 'a', 'b', 'c', 'd'], dtype='object')

In [38]:
df.drop('Unnamed: 0',axis = 1)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [2]:
# Pandas can read tables from html as well
mylist_of_tables = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [3]:
type(mylist_of_tables)

list

In [4]:
len(mylist_of_tables)

1

In [5]:
df = mylist_of_tables[0]
df

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","June 18, 2019"
1,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 1, 2019"
2,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
3,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
4,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
5,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","January 29, 2019"
6,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,"March 3, 2017","January 29, 2019"
7,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,"January 27, 2017","January 29, 2019"
8,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,"January 13, 2017","May 18, 2017"
9,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","May 13, 2019"
10,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","December 13, 2018"
11,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","November 13, 2018"
12,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 14, 2018"
13,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","January 29, 2019"
14,Hometown National Bank,Longview,WA,35156,Twin City Bank,"October 2, 2015","February 19, 2018"
15,The Bank of Georgia,Peachtree City,GA,35259,Fidelity Bank,"October 2, 2015","July 9, 2018"
16,Premier Bank,Denver,CO,34112,"United Fidelity Bank, fsb","July 10, 2015","February 20, 2018"
17,Edgebrook Bank,Chicago,IL,57772,Republic Bank of Chicago,"May 8, 2015","January 29, 2019"
18,Doral Bank En Espaol,San Juan,PR,32102,Banco Popular de Puerto Rico,"February 27, 2015","January 29, 2019"
19,Capitol City Bank & Trust Company,Atlanta,GA,33938,First-Citizens Bank & Trust Company,"February 13, 2015","January 29, 2019"
20,Highland Community Bank,Chicago,IL,20290,"United Fidelity Bank, fsb","January 23, 2015","November 15, 2017"
21,First National Bank of Crestview,Crestview,FL,17557,First NBC Bank,"January 16, 2015","November 15, 2017"
22,Northern Star Bank,Mankato,MN,34983,BankVista,"December 19, 2014","January 3, 2018"
23,"Frontier Bank, FSB D/B/A El Paseo Bank",Palm Desert,CA,34738,"Bank of Southern California, N.A.","November 7, 2014","November 10, 2016"
24,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,"October 24, 2014","January 6, 2016"
25,NBRS Financial,Rising Sun,MD,4862,Howard Bank,"October 17, 2014","January 29, 2019"
26,"GreenChoice Bank, fsb",Chicago,IL,28462,"Providence Bank, LLC","July 25, 2014","December 12, 2016"
27,Eastside Commercial Bank,Conyers,GA,58125,Community & Southern Bank,"July 18, 2014","October 6, 2017"
28,The Freedom State Bank,Freedom,OK,12483,Alva State Bank & Trust Company,"June 27, 2014","February 21, 2018"
29,Valley Bank,Fort Lauderdale,FL,21793,"Landmark Bank, National Association","June 20, 2014","January 29, 2019"
...,...,...,...,...,...,...,...
526,"ANB Financial, NA",Bentonville,AR,33901,Pulaski Bank and Trust Company,"May 9, 2008","February 1, 2019"
527,Hume Bank,Hume,MO,1971,Security Bank,"March 7, 2008","January 31, 2019"
528,Douglass National Bank,Kansas City,MO,24660,Liberty Bank and Trust Company,"January 25, 2008","October 26, 2012"
529,Miami Valley Bank,Lakeview,OH,16848,The Citizens Banking Company,"October 4, 2007","September 12, 2016"
530,NetBank,Alpharetta,GA,32575,ING DIRECT,"September 28, 2007","January 31, 2019"
531,Metropolitan Savings Bank,Pittsburgh,PA,35353,Allegheny Valley Bank of Pittsburgh,"February 2, 2007","October 27, 2010"
532,Bank of Ephraim,Ephraim,UT,1249,Far West Bank,"June 25, 2004","April 9, 2008"
533,Reliance Bank,White Plains,NY,26778,Union State Bank,"March 19, 2004","April 9, 2008"
534,Guaranty National Bank of Tallahassee,Tallahassee,FL,26838,Hancock Bank of Florida,"March 12, 2004","April 17, 2018"
535,Dollar Savings Bank,Newark,NJ,31330,No Acquirer,"February 14, 2004","April 9, 2008"
536,Pulaski Savings Bank,Philadelphia,PA,27203,Earthstar Bank,"November 14, 2003","October 6, 2017"
537,First National Bank of Blanchardville,Blanchardville,WI,11639,The Park Bank,"May 9, 2003","June 5, 2012"
538,Southern Pacific Bank,Torrance,CA,27094,Beal Bank,"February 7, 2003","October 20, 2008"
539,Farmers Bank of Cheneyville,Cheneyville,LA,16445,Sabine State Bank & Trust,"December 17, 2002","October 20, 2004"
540,Bank of Alamo,Alamo,TN,9961,No Acquirer,"November 8, 2002","March 18, 2005"
541,AmTrade International Bank En Espaol,Atlanta,GA,33784,No Acquirer,"September 30, 2002","September 11, 2006"
542,Universal Federal Savings Bank,Chicago,IL,29355,Chicago Community Bank,"June 27, 2002","October 6, 2017"
543,Connecticut Bank of Commerce,Stamford,CT,19183,Hudson United Bank,"June 26, 2002","February 14, 2012"
544,New Century Bank,Shelby Township,MI,34979,No Acquirer,"March 28, 2002","March 18, 2005"
545,Net 1st National Bank,Boca Raton,FL,26652,Bank Leumi USA,"March 1, 2002","April 9, 2008"
546,"NextBank, NA",Phoenix,AZ,22314,No Acquirer,"February 7, 2002","February 5, 2015"
547,Oakwood Deposit Bank Co.,Oakwood,OH,8966,The State Bank & Trust Company,"February 1, 2002","October 25, 2012"
548,Bank of Sierra Blanca,Sierra Blanca,TX,22002,The Security State Bank of Pecos,"January 18, 2002","November 6, 2003"
549,"Hamilton Bank, NA En Espaol",Miami,FL,24382,Israel Discount Bank of New York,"January 11, 2002","September 21, 2015"
550,Sinclair National Bank,Gravette,AR,34248,Delta Trust & Bank,"September 7, 2001","October 6, 2017"
551,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
552,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
553,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
554,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
555,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [6]:
# Read the file
pop = pd.read_csv("Data/population_by_county.csv")

In [8]:
pop.head()

             County           State  2010Census  2017PopEstimate
0  Abbeville County  South Carolina       25417            24722
1     Acadia Parish       Louisiana       61773            62590
2   Accomack County        Virginia       33164            32545
3        Ada County           Idaho      392365           456849
4      Adair County            Iowa        7682             7054

In [9]:
# Column names
pop.columns

Index(['County', 'State', '2010Census', '2017PopEstimate'], dtype='object')

In [11]:
# How many states are represented in the dataframe
pop['State'].nunique()

51

In [12]:
# Get a list/array of all states
pop['State'].unique()

array(['South Carolina', 'Louisiana', 'Virginia', 'Idaho', 'Iowa',
       'Kentucky', 'Missouri', 'Oklahoma', 'Colorado', 'Illinois',
       'Indiana', 'Mississippi', 'Nebraska', 'North Dakota', 'Ohio',
       'Pennsylvania', 'Washington', 'Wisconsin', 'Vermont', 'Minnesota',
       'Florida', 'North Carolina', 'California', 'New York', 'Wyoming',
       'Michigan', 'Alaska', 'Maryland', 'Kansas', 'Tennessee', 'Texas',
       'Maine', 'Arizona', 'Georgia', 'Arkansas', 'New Jersey',
       'South Dakota', 'Alabama', 'Oregon', 'West Virginia',
       'Massachusetts', 'Utah', 'Montana', 'New Hampshire', 'New Mexico',
       'Rhode Island', 'Nevada', 'District of Columbia', 'Connecticut',
       'Hawaii', 'Delaware'], dtype=object)

In [13]:
# What are the five most common county names in the US?
pop['County'].value_counts().head()

Washington County    30
Jefferson County     25
Franklin County      24
Jackson County       23
Lincoln County       23
Name: County, dtype: int64

In [18]:
# Another alternate long approach
pop.groupby('County').count().sort_values(by='State',ascending=False).head()

                   State  2010Census  2017PopEstimate
County
Washington County     30          30               30
Jefferson County      25          25               25
Franklin County       24          24               24
Jackson County        23          23               23
Lincoln County        23          23               23

In [20]:
# Five most populated counties
pop.sort_values(by='2010Census',ascending=False).head()

                  County       State  2010Census  2017PopEstimate
1713  Los Angeles County  California     9818605         10163507
628          Cook County    Illinois     5194675          5211263
1209       Harris County       Texas     4092459          4652980
1784     Maricopa County     Arizona     3817117          4307033
2501    San Diego County  California     3095313          3337685

In [22]:
# Five most populated states
pop.groupby('State').sum().sort_values(by='2010Census',ascending=False).head()

            2010Census  2017PopEstimate
State
California    37253956         39536653
Texas         25145561         28304596
New York      19378102         19849399
Florida       18801310         20984400
Illinois      12830632         12802023

In [25]:
# how many counties have 2010 population greater than 1 million
len(pop[pop['2010Census'] > 1000000])

39

In [26]:
# An alternate approach
sum(pop['2010Census'] > 1000000)

39

In [27]:
# How many counties dont have the name 'County' in their name?
def check_county(name):
    return "County" not in name

In [29]:
sum(pop['County'].apply(check_county))

135

In [31]:
# Alternate approach using lambda expression
sum(pop['County'].apply(lambda name: "County" not in name))

135

In [32]:
# Add a column that calculates the percent change between 2010 Census and 2017 Population Estimate
pop['PercentChange'] = 100 * (pop['2017PopEstimate']-pop['2010Census'])/pop['2010Census']
pop.head()

,County,State,2010Census,2017PopEstimate,PercentChange
0,Abbeville County,South Carolina,25417,24722,-2.734390
1,Acadia Parish,Louisiana,61773,62590,1.322584
2,Accomack County,Virginia,33164,32545,-1.866482
3,Ada County,Idaho,392365,456849,16.434697
4,Adair County,Iowa,7682,7054,-8.174954

In [37]:
# What States have the highest estimated percent change between 2010 Census and the 2017 
# Population estimate

# STEP GROUP BY STATE, TAKE THE SUM OF THE POP COUNTY
states = pop.groupby(by='State').sum()
states


# STEP - Sort values by new percent changes

                      2010Census  2017PopEstimate  PercentChange
State
Alabama                  4779736          4874747     -90.104665
Alaska                    710231           739795      79.918865
Arizona                  6392017          7016270      61.091253
Arkansas                 2915918          3004279    -157.120655
California              37253956         39536653     171.318587
Colorado                 5029196          5607154     276.003951
Connecticut              3574097          3588184      -6.306999
Delaware                  897934           961939      27.192859
District of Columbia      601723           693972      15.330808
Florida                 18801310         20984400     511.173992
Georgia                  9687653         10429379     253.477434
Hawaii                   1360301          1427538      24.697324
Idaho                    1567582          1716943     131.246387
Illinois                12830632         12802023    -342.549294
Indiana                  6483802          6666818       9.627461
Iowa                     3046355          3145711    -123.916843
Kansas                   2853118          2913123    -314.245877
Kentucky                 4339367          4454189     -16.991862
Louisiana                4533372          4684333       5.617474
Maine                    1328361          1335907     -11.986641
Maryland                 5773552          6052177      61.820362
Massachusetts            6547629          6859819      50.253589
Michigan                 9883640          9962311     -88.318582
Minnesota                5303925          5576606      23.984215
Mississippi              2967297          2984100    -202.448241
Missouri                 5988927          6113532     -95.700507
Montana                   989415          1050493     121.568195
Nebraska                 1826341          1920076    -138.659568
Nevada                   2700551          2998039      24.691529
New Hampshire            1316470          1342795       7.003199
New Jersey               8791894          9005644      17.006799
New Mexico               2059179          2088070     -78.433347
New York                19378102         19849399     -78.778361
North Carolina           9535483         10273419     221.903768
North Dakota              672591           755393     308.640607
Ohio                    11536504         11658609     -54.867098
Oklahoma                 3751351          3930864       3.860638
Oregon                   3831074          4142776     151.366592
Pennsylvania            12702379         12805537     -95.758663
Rhode Island             1052567          1059639      -1.630958
South Carolina           4625364          5024369     105.281744
South Dakota              814180           869666     107.905241
Tennessee                6346105          6715984     246.721205
Texas                   25145561         28304596     955.535377
Utah                     2763885          3101833     216.823276
Vermont                   625741           623657     -12.529791
Virginia                 8001024          8470020     216.452138
Washington               6724540          7405743     243.405927
West Virginia            1852994          1815857    -176.749259
Wisconsin                5686986          5795483       8.253743
Wyoming                   563626           579315      20.144261

In [40]:
# STEP - Recalculate the  percent changes
states['NewPercentChange'] = 100 * (states['2017PopEstimate']-states['2010Census']
                                   )/states['2010Census']

In [41]:
states.sort_values('NewPercentChange',ascending=False).head()

,2010Census,2017PopEstimate,PercentChange,NewPercentChange
State,,,,
District of Columbia,601723,693972,15.330808,15.330808
Texas,25145561,28304596,955.535377,12.562993
North Dakota,672591,755393,308.640607,12.310899
Utah,2763885,3101833,216.823276,12.227282
Florida,18801310,20984400,511.173992,11.611372